In [ ]:
#Task1

In [1]:
price = [80121, 48483, 37077, 30660, 68536, 52666, 78703, 51036, 55643, 56990, 39967, 93822, 51406, 93947, 78373, 62765, 47536, 40528, 58780, 83197]

In [2]:
import pandas as pd
import numpy as np
index_ser=  np.arange(101,121)
price_ser = pd.Series(price,index=index_ser)
print("prices of the cars:")
price_ser

prices of the cars:

101    80121
102    48483
103    37077
104    30660
105    68536
106    52666
107    78703
108    51036
109    55643
110    56990
111    39967
112    93822
113    51406
114    93947
115    78373
116    62765
117    47536
118    40528
119    58780
120    83197
dtype: int64

In [4]:
#TAsk2 identify the row indexes and prices of the cars with the highest price and the lowest price

In [3]:
x=price_ser.sort_values(ascending = False)
print("prices of the cars with the highest price\n",x[:1])

prices of the cars with the highest price
 114    93947
dtype: int64

In [4]:
y=price_ser.sort_values()
print("prices of the cars with the lowest price\n",y[:1])

prices of the cars with the lowest price
 104    30660
dtype: int64

In [5]:
#task3 Display the price of the top 5 cars with highest value, along with their row index

In [6]:
import pandas as pd
import numpy as np
top_5_cars =price_ser.sort_values(ascending = False)
print("Top 5 cars with the highest value, along with their row index")
top_5_cars[:5]

Top 5 cars with the highest value, along with their row index

114    93947
112    93822
120    83197
101    80121
107    78703
dtype: int64

In [7]:
#Task 4
#Display the prices of all cars priced between $30-40k along with the row indexes. 
#Calculate and display the count of these cars.

In [8]:
prices_between_30_40 = price_ser.between(30000, 40000, inclusive= 'both')
print("Prices of all cars priced between $30-40k along with row indexes")
price_ser[prices_between_30_40]

Prices of all cars priced between $30-40k along with row indexes

103    37077
104    30660
111    39967
dtype: int64

In [11]:
print("Total number of cars between $30k-40k:",len(price_ser[prices_between_30_40]))

Total number of cars between $30k-40k: 3

In [12]:
#Task 5
#Display the prices and row indexes of those cars that are priced above the average price of all cars. 
#Display the count of such cars.

In [13]:
condition = np.mean(price_ser)<price_ser
condition

101     True
102    False
103    False
104    False
105     True
106    False
107     True
108    False
109    False
110    False
111    False
112     True
113    False
114     True
115     True
116     True
117    False
118    False
119    False
120     True
dtype: bool

In [14]:
print("Prices of cars that are priced above the average price")
b = price_ser[condition]
b

Prices of cars that are priced above the average price

101    80121
105    68536
107    78703
112    93822
114    93947
115    78373
116    62765
120    83197
dtype: int64

In [15]:
print("Total number of cars:",len(b))

Total number of cars: 8

In [16]:
#Task 6
#The car dealer needs to add three new cars with the row indexes 201, 202, and 203 priced at $34,000, 
#$45,000, and $54,000, respectively. Update the existing data and display the prices along with the row indexes for all cars.

In [17]:
new_price_ser = pd.Series([34000,45000, 54000], index=[201,202,203])
new_price_ser

201    34000
202    45000
203    54000
dtype: int64

In [18]:
price_ser=pd.concat([price_ser,new_price_ser])
price_ser

101    80121
102    48483
103    37077
104    30660
105    68536
106    52666
107    78703
108    51036
109    55643
110    56990
111    39967
112    93822
113    51406
114    93947
115    78373
116    62765
117    47536
118    40528
119    58780
120    83197
201    34000
202    45000
203    54000
dtype: int64

In [19]:
#Task 7
#The car dealer is offering a discount of 20% on the cars priced above $60,000.
#Display the row indexes along with the original and discounted prices of all such cars.

In [20]:
condition = price_ser>60000
condition

101     True
102    False
103    False
104    False
105     True
106    False
107     True
108    False
109    False
110    False
111    False
112     True
113    False
114     True
115     True
116     True
117    False
118    False
119    False
120     True
201    False
202    False
203    False
dtype: bool

In [21]:
original_price = price_ser[condition]
original_price

101    80121
105    68536
107    78703
112    93822
114    93947
115    78373
116    62765
120    83197
dtype: int64

In [22]:
price_after_discount = original_price*0.8
price_after_discount

101    64096.8
105    54828.8
107    62962.4
112    75057.6
114    75157.6
115    62698.4
116    50212.0
120    66557.6
dtype: float64

In [23]:
updated_price = pd.DataFrame({"Discounted Price":price_after_discount})

In [24]:
updated_price

     Discounted Price
101           64096.8
105           54828.8
107           62962.4
112           75057.6
114           75157.6
115           62698.4
116           50212.0
120           66557.6

In [25]:
original_and_discounted_price = pd.DataFrame({"Original Price":original_price,"Discounted Price":price_after_discount,})
original_and_discounted_price

     Original Price  Discounted Price
101           80121           64096.8
105           68536           54828.8
107           78703           62962.4
112           93822           75057.6
114           93947           75157.6
115           78373           62698.4
116           62765           50212.0
120           83197           66557.6

Task 8
The cars priced above $60,000 are now sold due to the 20 %   discount offered by the dealer. Update the data by deleting the details of the cars sold and print the updated data. Display the count of cars before and after the updating of the data

In [10]:
df_cars_price_original= pd.DataFrame({"original price":price_ser})
df_cars_price_original

     original price
101           80121
102           48483
103           37077
104           30660
105           68536
106           52666
107           78703
108           51036
109           55643
110           56990
111           39967
112           93822
113           51406
114           93947
115           78373
116           62765
117           47536
118           40528
119           58780
120           83197

In [11]:
print("count of cars before updating the data is",len(df_cars_price_original))

count of cars before updating the data is 20

In [12]:
condition4 = price_ser<=60000

In [13]:
condition4

101    False
102     True
103     True
104     True
105    False
106     True
107    False
108     True
109     True
110     True
111     True
112    False
113     True
114    False
115    False
116    False
117     True
118     True
119     True
120    False
dtype: bool

In [14]:
unsold_cars = price_ser[condition4]

In [15]:
unsold_cars

102    48483
103    37077
104    30660
106    52666
108    51036
109    55643
110    56990
111    39967
113    51406
117    47536
118    40528
119    58780
dtype: int64

In [16]:
len(unsold_cars)

12